# TASK 2 CREAT DATA FRAME

In [2]:
import pandas as pd

In [3]:
grades_dict= {'Tunde': [10,20,30], 'Dayo':[40,50,60], 'Amelie':[70,80,90], 'James':[15,25,35], 'Denise':[45,55,65]}

In [5]:
grades=pd.DataFrame(grades_dict)

In [6]:
grades

   Tunde  Dayo  Amelie  James  Denise
0     10    40      70     15      45
1     20    50      80     25      55
2     30    60      90     35      65

# CUSTOM INDEX

In [8]:
grades.index=['Test 1', 'Test 2', 'Test 3']

In [9]:
grades

        Tunde  Dayo  Amelie  James  Denise
Test 1     10    40      70     15      45
Test 2     20    50      80     25      55
Test 3     30    60      90     35      65

In [10]:
grades['Tunde']

Test 1    10
Test 2    20
Test 3    30
Name: Tunde, dtype: int64

In [11]:
grades.Dayo

Test 1    40
Test 2    50
Test 3    60
Name: Dayo, dtype: int64

In [17]:
grades.loc['Test 1']

Tunde     10
Dayo      40
Amelie    70
James     15
Denise    45
Name: Test 1, dtype: int64

In [18]:
grades.iloc[1]

Tunde     20
Dayo      50
Amelie    80
James     25
Denise    55
Name: Test 2, dtype: int64

In [22]:
grades.iloc[0:2]

        Tunde  Dayo  Amelie  James  Denise
Test 1     10    40      70     15      45
Test 2     20    50      80     25      55

In [23]:
grades.loc['Test 1':'Test 3']

        Tunde  Dayo  Amelie  James  Denise
Test 1     10    40      70     15      45
Test 2     20    50      80     25      55
Test 3     30    60      90     35      65

In [27]:
grades.at['Test 2', 'Tunde']

20

In [28]:
grades.at['Test 3', 'Denise']

65

In [32]:
grades.iat[2, 0]

30

In [34]:
grades.iat[1,0]

20

In [36]:
grades.iat[2,4]

65

# Task 4. Describe by column

In [38]:
grades.describe()

       Tunde  Dayo  Amelie  James  Denise
count    3.0   3.0     3.0    3.0     3.0
mean    20.0  50.0    80.0   25.0    55.0
std     10.0  10.0    10.0   10.0    10.0
min     10.0  40.0    70.0   15.0    45.0
25%     15.0  45.0    75.0   20.0    50.0
50%     20.0  50.0    80.0   25.0    55.0
75%     25.0  55.0    85.0   30.0    60.0
max     30.0  60.0    90.0   35.0    65.0

In [43]:
pd.set_option("display.precision",2)

In [44]:
grades.describe()

       Tunde  Dayo  Amelie  James  Denise
count    3.0   3.0     3.0    3.0     3.0
mean    20.0  50.0    80.0   25.0    55.0
std     10.0  10.0    10.0   10.0    10.0
min     10.0  40.0    70.0   15.0    45.0
25%     15.0  45.0    75.0   20.0    50.0
50%     20.0  50.0    80.0   25.0    55.0
75%     25.0  55.0    85.0   30.0    60.0
max     30.0  60.0    90.0   35.0    65.0

# Task 5. Transpose

In [45]:
grades.mean()

Tunde     20.0
Dayo      50.0
Amelie    80.0
James     25.0
Denise    55.0
dtype: float64

In [46]:
grades.T

        Test 1  Test 2  Test 3
Tunde       10      20      30
Dayo        40      50      60
Amelie      70      80      90
James       15      25      35
Denise      45      55      65

In [50]:
grades.T.describe()

       Test 1  Test 2  Test 3
count    5.00    5.00    5.00
mean    36.00   46.00   56.00
std     24.34   24.34   24.34
min     10.00   20.00   30.00
25%     15.00   25.00   35.00
50%     40.00   50.00   60.00
75%     45.00   55.00   65.00
max     70.00   80.00   90.00

In [47]:
grades.T.mean()

Test 1    36.0
Test 2    46.0
Test 3    56.0
dtype: float64

In [51]:
grades.sort_index(ascending=False)

        Tunde  Dayo  Amelie  James  Denise
Test 3     30    60      90     35      65
Test 2     20    50      80     25      55
Test 1     10    40      70     15      45

In [52]:
grades.sort_index(axis=1)

        Amelie  Dayo  Denise  James  Tunde
Test 1      70    40      45     15     10
Test 2      80    50      55     25     20
Test 3      90    60      65     35     30